<picture><img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></picture> 




<div align="right"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>&nbsp;3&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;7&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;6&nbsp;Medium&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;11&nbsp;Low</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I01-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 1</td>

<td>Inbound "From Any allow Any service" rules from Public IPs</td>

</tr>
<tr>

<td>O02-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 11</td>

<td>Outbound "To Any allow all TCP" rules to Public IPs</td>

</tr>
<tr>

<td>O03-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 11</td>

<td>Outbound "To Any allow all UDP" rules to Public IPs</td>

</tr>
<tr>

<td>O05-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 13</td>

<td>"Any" service can exit your network to Public IPs</td>

</tr>
<tr>

<td>O04-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 14</td>

<td>TCP on all ports can exit your network to Public IPs</td>

</tr>
<tr>

<td>O06-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 14</td>

<td>UDP on all ports can exit your network to Public IPs</td>

</tr>
<tr>

<td>I07-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 2</td>

<td>LDAP Port TCP/389, UDP/389 open from Public IPs</td>

</tr>
<tr>

<td>Auto01</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 5, Scenario 6</td>

<td>Administrative port 22 (ssh) open to more than 256 IPs from the Internet</td>

</tr>
<tr>

<td>O01-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 9</td>

<td>Outbound "To Any allow Any service" rules to Public IPs</td>

</tr>
<tr>

<td>O09-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 10</td>

<td>SMTP can exit your network to more than 256 Public IPs</td>

</tr>
<tr>

<td>O02-NI-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 13</td>

<td>"Any" service can exit your network to Private IPs</td>

</tr>
<tr>

<td>O01-NI-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 14</td>

<td>TCP on all ports can exit your network to Private IPs</td>

</tr>
<tr>

<td>O03-NI-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 14</td>

<td>UDP on all ports can exit your network to Private IPs</td>

</tr>
<tr>

<td>I04-NI-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 4</td>

<td>LDAP Port TCP/389, UDP/389 open from Private IPs</td>

</tr>
<tr>

<td>I21-NI-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 5</td>

<td>Administrative port 22 (ssh) can enter your network from more than 256 Private IPs</td>

</tr>
<tr>

<td>Auto07</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 1, Scenario 2, Scenario 3, Scenario 7</td>

<td>CIDR test</td>

</tr>
<tr>

<td>Auto04</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 11, Scenario 14</td>

<td>Outbound,port 102</td>

</tr>
<tr>

<td>O06-NI-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 12</td>

<td>SMTP can exit your network to more than 256 Private IPs</td>

</tr>
<tr>

<td>Auto08</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 2, Scenario 3</td>

<td>public ips</td>

</tr>
<tr>

<td>Auto09</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 2, Scenario 3</td>

<td>multiple public ips</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 1</b></h3><div  align="right"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>&nbsp;1&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;1&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>  I01-I-SG</summary> 

### **Title:**
Inbound "From Any allow Any service" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with service Any : PASS" are usually more open than is necessary. Allowing all services allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected from internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto07</summary> 

### **Title:**
CIDR test

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario1: Refreshing state... [id=sg-0d46f9a0c3c6e8fbb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario1 will be created
  + resource "aws_security_group" "Scenario1" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "SG with all port and all IP. "
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario1"
        }
      + tags_all               = {
          + "Name" = "Scenario1"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 1\tmp\Scenario 1.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 1\\tmp\\Scenario 1.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 10</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  O09-I-SG</summary> 

### **Title:**
SMTP can exit your network to more than 256 Public IPs

### **Description:**
Allowing outbound SMTP access on TCP port 25/465/587 from many internal machines is risky.  Outbound SMTP (E-mail) should only originate from your public mail servers.  E-mail is a vector for many viruses and worms.  Computers that can send E-mail directly (not through your organization's designated mail servers) can bypass your network's E-mail filters, and spread viruses and worms to other networks.  Therefore, outbound SMTP access should be limited to your properly hardened public mail servers. 

### **Recommendation:**
Restrict the rules to refer to only the destination IPs you really use, and limit the number of public IP addresses that can be reached on this port. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>25</td>

  <td>25</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario10 will be created
  + resource "aws_security_group" "Scenario10" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 25
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 25
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 25
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 25
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario10"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Single port(UDP and TCP) and all IP."
        }
      + tags_all               = {
          + "Name" = "SG with Single port(UDP and TCP) and all IP."
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 10\tmp\Scenario 10.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 10\\tmp\\Scenario 10.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 11</b></h3><div  align="right"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>&nbsp;2&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;1&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>  O02-I-SG</summary> 

### **Title:**
Outbound "To Any allow all TCP" rules to Public IPs

### **Description:**
Outbound rules of the form "to Any with all TCP" are usually more open than is necessary. Allowing all TCP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access to all destinations may allow exfiltration of information. 

### **Recommendation:**
Restrict the rules to refer to the destination IPs you really use, and to the the services your applications rely on by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>  O03-I-SG</summary> 

### **Title:**
Outbound "To Any allow all UDP" rules to Public IPs

### **Description:**
Outbound rules of the form "to Any with all UDP" are usually more open than is necessary. Allowing all UDP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access to all destinations may allow exfiltration of information. 

### **Recommendation:**
Restrict the rules to refer to the destination IPs you really use, and to the the services your applications rely on by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto04</summary> 

### **Title:**
Outbound,port 102

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation $535&()#1@#$%[]

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario11 will be created
  + resource "aws_security_group" "Scenario11" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario11"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with port range(UDP and TCP) and all IP."
        }
      + tags_all               = {
          + "Name" = "SG with port range(UDP and TCP) and all IP."
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 11\tmp\Scenario 11.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 11\\tmp\\Scenario 11.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 12</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;1&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  O06-NI-SG</summary> 

### **Title:**
SMTP can exit your network to more than 256 Private IPs

### **Description:**
 Allowing outbound SMTP access on TCP port  25/465/587 from many internal machines is risky.  Outbound SMTP (E-mail) should only originate from your public mail servers.  E-mail is a vector for many viruses and worms.  Computers that can send E-mail directly (not through your organization's designated mail servers) can bypass your network's E-mail filters, and spread viruses and worms to other networks.  Therefore, outbound SMTP access should be limited to your properly hardened public mail servers. 
    


### **Recommendation:**
Restrict the rules to refer to only the destination IPs you really use, and limit the number of public IP addresses that can be reached on this port. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>25</td>

  <td>25</td>

  <td>tcp</td>

  <td>172.16.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario12 will be created
  + resource "aws_security_group" "Scenario12" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 25
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 25
            },
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 25
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 25
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario12"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Single port(UDP and TCP) and single IP"
        }
      + tags_all               = {
          + "Name" = "SG with Single port(UDP and TCP) and single IP"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 12\tmp\Scenario 12.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 12\\tmp\\Scenario 12.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 13</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  O05-I-SG</summary> 

### **Title:**
"Any" service can exit your network to Public IPs

### **Description:**
Allowing "Any" service to exit your network is extremely risky since the "Any" service includes many vulnerable services.  The largest threat is that of Trojan horses contacting their controllers, followed by unintended information leakage, and spreading of malicious code like viruses and worms.

### **Recommendation:**
Review all the rules that allow outbound traffic with 
the service "Any" service, and limit them to those services you actually require.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>4.4.4.0/24</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  O02-NI-SG</summary> 

### **Title:**
"Any" service can exit your network to Private IPs

### **Description:**
Allowing "Any" service to exit your network is extremely risky since the "Any" service includes many vulnerable services.  The largest threat is that of Trojan horses contacting their controllers, followed by unintended information leakage, and spreading of malicious code like viruses and worms.

### **Recommendation:**
Review all the rules that allow outbound traffic with 
the service "Any" service, and limit them to those services you actually require by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>192.168.1.2/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>192.168.1.3/32</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario13 will be created
  + resource "aws_security_group" "Scenario13" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "4.4.4.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "4.4.4.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "4.4.4.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario13"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Single port(UDP, TCP and all) and Multiple IP"
        }
      + tags_all               = {
          + "Name" = "SG with Single port(UDP, TCP and all) and Multiple IP"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 13\tmp\Scenario 13.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 13\\tmp\\Scenario 13.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 14</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;2&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;2&nbsp;Medium&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;1&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  O04-I-SG</summary> 

### **Title:**
TCP on all ports can exit your network to Public IPs

### **Description:**
Allowing TCP on all ports to exit your network is extremely risky since this includes many vulnerable services. The largest threat is that of Trojan horses contacting their controllers, followed by unintended information leakage, and spreading of malicious code like viruses and worms.

### **Recommendation:**
Review all the rules that allow outbound traffic with 
TCP on all ports, and limit them to those services you 
actually require by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>tcp</td>

  <td>4.4.4.0/24</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  O06-I-SG</summary> 

### **Title:**
UDP on all ports can exit your network to Public IPs

### **Description:**
Allowing UDP on all ports to exit your network is extremely risky since this includes many vulnerable services.  The largest threat is that of Trojan horses contacting their controllers, followed by unintended information leakage, and spreading of malicious code like viruses and worms.

### **Recommendation:**
Review all the rules that allow outbound traffic with 
UDP on all ports, and limit them to those services you 
actually require by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>4.4.4.0/24</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  O01-NI-SG</summary> 

### **Title:**
TCP on all ports can exit your network to Private IPs

### **Description:**
Allowing TCP on all ports to exit your network is extremely risky since this includes many vulnerable services. The largest threat is that of Trojan horses contacting their controllers, followed by unintended information leakage, and spreading of malicious code like viruses and worms. 

### **Recommendation:**
Review all the rules that allow outbound traffic with 
TCP on all ports, and limit them to those services you 
actually require by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>tcp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>tcp</td>

  <td>192.168.1.2/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>tcp</td>

  <td>192.168.1.3/32</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  O03-NI-SG</summary> 

### **Title:**
UDP on all ports can exit your network to Private IPs

### **Description:**
Allowing UDP on all ports to exit your network is extremely risky since this includes many vulnerable services.  The largest threat is that of Trojan horses contacting their controllers, followed by unintended information leakage, and spreading of malicious code like viruses and worms.

### **Recommendation:**
Review all the rules that allow outbound traffic with 
UDP on all ports, and limit them to those services you 
actually require by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>192.168.1.2/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>192.168.1.3/32</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto04</summary> 

### **Title:**
Outbound,port 102

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation $535&()#1@#$%[]

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>192.168.1.2/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>192.168.1.3/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>65535</td>

  <td>udp</td>

  <td>4.4.4.0/24</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario14 will be created
  + resource "aws_security_group" "Scenario14" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "4.4.4.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "4.4.4.0/24",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario14"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with port range(UDP and TCP) and all Multiple IP"
        }
      + tags_all               = {
          + "Name" = "SG with port range(UDP and TCP) and all Multiple IP"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 14\tmp\Scenario 14.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 14\\tmp\\Scenario 14.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 15</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario15 will be created
  + resource "aws_security_group" "Scenario15" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario15"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Rule with ICMP protocol"
        }
      + tags_all               = {
          + "Name" = "SG with Rule with ICMP protocol"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 15\tmp\Scenario 15.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 15\\tmp\\Scenario 15.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 16</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario16 will be created
  + resource "aws_security_group" "Scenario16" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-5728062a",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario16"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Rule with SG in source"
        }
      + tags_all               = {
          + "Name" = "SG with Rule with SG in source"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 16\tmp\Scenario 16.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 16\\tmp\\Scenario 16.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 2</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;3&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  I07-I-SG</summary> 

### **Title:**
LDAP Port TCP/389, UDP/389 open from Public IPs

### **Description:**
Your cloud  LDAP server is accessible using the LDAP port (UDP/389, TCP/389).  LDAP (Lightweight Directory Access Protocol) is a directory service for controling access to network capable devices. Allowing access to these ports from public IP addresses is risky.


### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.


### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto07</summary> 

### **Title:**
CIDR test

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto08</summary> 

### **Title:**
public ips

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto09</summary> 

### **Title:**
multiple public ips

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario2: Refreshing state... [id=sg-01f3f801bfc0ed9bc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario2 will be created
  + resource "aws_security_group" "Scenario2" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
        ]
      + name                   = "SG with Single port(UDP and TCP) and all IP."
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario2"
        }
      + tags_all               = {
          + "Name" = "Scenario2"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 2\tmp\Scenario 2.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 2\\tmp\\Scenario 2.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 3</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;3&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto07</summary> 

### **Title:**
CIDR test

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>3020</td>

  <td>3050</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>3020</td>

  <td>3050</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto08</summary> 

### **Title:**
public ips

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>3020</td>

  <td>3050</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto09</summary> 

### **Title:**
multiple public ips

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>3020</td>

  <td>3050</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario3: Refreshing state... [id=sg-02c1baf82d698af4d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario3 will be created
  + resource "aws_security_group" "Scenario3" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3020
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3050
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3020
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 3050
            },
        ]
      + name                   = "SG with port range(UDP and TCP) and all IP."
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario3"
        }
      + tags_all               = {
          + "Name" = "Scenario3"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 3\tmp\Scenario 3.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 3\\tmp\\Scenario 3.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 4</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  I04-NI-SG</summary> 

### **Title:**
LDAP Port TCP/389, UDP/389 open from Private IPs

### **Description:**
Your cloud  LDAP server is accessible using the LDAP port (UDP/389, TCP/389).  LDAP (Lightweight Directory Access Protocol) is a directory service for controling access to network capable devices. Allowing access to these ports is risky.


### **Recommendation:**
Eliminate rules which allow access to this port from private IPs.


### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>192.168.1.1/32</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario4: Refreshing state... [id=sg-06c9c6a90fa2e5cc9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario4 will be created
  + resource "aws_security_group" "Scenario4" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
        ]
      + name                   = "SG with Single port(UDP and TCP) and single IP"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario4"
        }
      + tags_all               = {
          + "Name" = "Scenario4"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 4\tmp\Scenario 4.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 4\\tmp\\Scenario 4.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 5</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  Auto01</summary> 

### **Title:**
Administrative port 22 (ssh) open to more than 256 IPs from the Internet

### **Description:**
Your cloud estate is accessible from more than 256 IP addresses using the SSH service (TCP/22).  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.1.2/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.1.3/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  I21-NI-SG</summary> 

### **Title:**
Administrative port 22 (ssh) can enter your network from more than 256 Private IPs

### **Description:**
Allowing access from more than 256 Private IP addresses using the SSH service (TCP/22) is risky.  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from too many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>22</td>

  <td>22</td>

  <td>tcp</td>

  <td>192.168.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario5: Refreshing state... [id=sg-0a76ddfb4eba2f7c4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario5 will be created
  + resource "aws_security_group" "Scenario5" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "SG with Single port(UDP and TCP) and Multiple IP"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario5"
        }
      + tags_all               = {
          + "Name" = "Scenario5"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 5\tmp\Scenario 5.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 5\\tmp\\Scenario 5.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 6</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  Auto01</summary> 

### **Title:**
Administrative port 22 (ssh) open to more than 256 IPs from the Internet

### **Description:**
Your cloud estate is accessible from more than 256 IP addresses using the SSH service (TCP/22).  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>22</td>

  <td>30</td>

  <td>tcp</td>

  <td>192.168.1.1/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>30</td>

  <td>tcp</td>

  <td>192.168.1.2/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>30</td>

  <td>tcp</td>

  <td>192.168.1.3/32</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>22</td>

  <td>30</td>

  <td>tcp</td>

  <td>192.168.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario6 will be created
  + resource "aws_security_group" "Scenario6" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 30
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 30
            },
        ]
      + name                   = "SG with port range(UDP and TCP) and all Multiple IP"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario6"
        }
      + tags_all               = {
          + "Name" = "Scenario6"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 6\tmp\Scenario 6.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 6\\tmp\\Scenario 6.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 7</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;1&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto07</summary> 

### **Title:**
CIDR test

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>-1</td>

  <td>-1</td>

  <td>icmp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario7: Refreshing state... [id=sg-04aa74617d7a1016e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario7 will be created
  + resource "aws_security_group" "Scenario7" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + name                   = "SG with Rule with ICMP protocol"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario7"
        }
      + tags_all               = {
          + "Name" = "Scenario7"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 7\tmp\Scenario 7.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 7\\tmp\\Scenario 7.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 8</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario8 will be created
  + resource "aws_security_group" "Scenario8" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-5728062a",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "SG with Rule with SG in source"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario8"
        }
      + tags_all               = {
          + "Name" = "Scenario8"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 8\tmp\Scenario 8.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 8\\tmp\\Scenario 8.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 9</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  O01-I-SG</summary> 

### **Title:**
Outbound "To Any allow Any service" rules to Public IPs

### **Description:**
Outbound rules of the form "to Any with service Any" are usually more open than is necessary. Allowing all services allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access to all destinations may allow exfiltration of information. 

### **Recommendation:**
Restrict the rules to refer to the destination IPs you really use, and to the the services your applications rely on by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario9 will be created
  + resource "aws_security_group" "Scenario9" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario9"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with all port and all IP"
        }
      + tags_all               = {
          + "Name" = "SG with all port and all IP"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 9\tmp\Scenario 9.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/AWS/Scenario 9\\tmp\\Scenario 9.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 1</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'plan -input=false -no-color -out=/home/runner/work/AutomationRepo/AutomationRepo_ALGOSEC_CODE_ANALYSIS/src/Azure/Scenario 1\tmp\Scenario 1.out': 
Error: building AzureRM Client: obtain subscription() from Azure CLI: parsing json result from the Azure CLI: waiting for the Azure CLI: exit status 1: ERROR: Please run 'az login' to setup account.

  with provider["registry.terraform.io/hashicorp/azurerm"],
  on main.tf line 1, in provider "azurerm":
   1: provider "azurerm" {

: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---


<br>
Pusher: @DevSecOpsAutomation<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD